In [1]:
!pip install ipython-sql sqlalchemy

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.29)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (2.0.3)
Requirement already satisfied: matplotlib in /usr/local/lib/python3.10/dist-packages (3.7.1)
Requirement already satisfied: seaborn in /usr/local/lib/python3.10/dist-packages (0.13.1)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2023.4)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/dist-packages (from pandas) (1.25.2)
Requirement already satisfied: contourpy>=1.0.1 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (1.2.1)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (4.51.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=6.2.0 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (9.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in /usr/local/lib/python3.10/dist-packages (from matplotlib) (3.1.2)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 7.7 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [5]:
%load_ext sql
%sql sqlite:///bookstore.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

**Remove Tables**

In [8]:
%%sql

DROP TABLE Books;
DROP TABLE Customers;
DROP TABLE Orders;
DROP TABLE Suppliers;
DROP TABLE SupplyOrders;
DROP TABLE BookReviews;

 * sqlite:///bookstore.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

**Create Tables**

In [9]:
%%sql

-- Books table
CREATE TABLE Books (
    BookID INTEGER PRIMARY KEY,
    Title TEXT NOT NULL,
    Author TEXT NOT NULL,
    Genre TEXT,
    Price REAL,
    Stock INTEGER
);

-- Customers table
CREATE TABLE Customers (
    CustomerID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    Email TEXT,
    Address TEXT
);

-- Orders table
CREATE TABLE Orders (
    OrderID INTEGER PRIMARY KEY,
    CustomerID INTEGER,
    BookID INTEGER,
    Quantity INTEGER,
    OrderDate DATE,
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID),
    FOREIGN KEY (BookID) REFERENCES Books(BookID)
);

-- Suppliers table
CREATE TABLE Suppliers (
    SupplierID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    ContactInfo TEXT
);

-- Supply Orders table
CREATE TABLE SupplyOrders (
    SupplyOrderID INTEGER PRIMARY KEY,
    SupplierID INTEGER,
    BookID INTEGER,
    Quantity INTEGER,
    OrderDate DATE,
    FOREIGN KEY (SupplierID) REFERENCES Suppliers(SupplierID),
    FOREIGN KEY (BookID) REFERENCES Books(BookID)
);

-- Book Reviews table
CREATE TABLE BookReviews (
    ReviewID INTEGER PRIMARY KEY AUTOINCREMENT,
    BookID INTEGER,
    CustomerID INTEGER,
    Rating INTEGER,
    ReviewText TEXT,
    ReviewDate DATE,
    FOREIGN KEY (BookID) REFERENCES Books(BookID),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

 * sqlite:///bookstore.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

**Delete All Data in the Tables**

In [30]:
%%sql
DELETE FROM Books;
DELETE FROM Customers;
DELETE FROM Orders;
DELETE FROM Suppliers;
DELETE FROM SupplyOrders;
DELETE FROM BookReviews;

 * sqlite:///bookstore.db
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.

[]

**Insert Data into the Table**

In [31]:
%%sql

INSERT INTO Books (Title, Author, Genre, Price, Stock) VALUES
('Book Title A', 'Author A', 'Genre A', 1.00, 1),
('Book Title B', 'Author B', 'Genre B', 2.00, 2),
('Book Title C', 'Author C', 'Genre C', 3.00, 3),
('Book Title D', 'Author D', 'Genre D', 4.00, 4),
('Book Title E', 'Author E', 'Genre E', 5.00, 5);

INSERT INTO Customers (Name, Email, Address) VALUES
('Customer A', 'emailA@example.com', 'Address A'),
('Customer B', 'emailB@example.com', 'Address B'),
('Customer C', 'emailC@example.com', 'Address C'),
('Customer D', 'emailD@example.com', 'Address D'),
('Customer E', 'emailE@example.com', 'Address E');

INSERT INTO Orders (CustomerID, BookID, Quantity, OrderDate) VALUES
(1, 1, 1, '2024-01-01'),
(2, 2, 2, '2024-01-02'),
(3, 3, 3, '2024-01-03'),
(4, 4, 4, '2024-01-04'),
(5, 5, 5, '2024-01-05');

INSERT INTO Suppliers (Name, ContactInfo) VALUES
('Supplier A', 'Contact A'),
('Supplier B', 'Contact B'),
('Supplier C', 'Contact C'),
('Supplier D', 'Contact D'),
('Supplier E', 'Contact E');

INSERT INTO SupplyOrders (SupplierID, BookID, Quantity, OrderDate) VALUES
(1, 1, 10, '2024-01-10'),
(2, 2, 20, '2024-01-20'),
(3, 3, 30, '2024-01-30'),
(4, 4, 40, '2024-02-10'),
(5, 5, 50, '2024-02-20');

INSERT INTO BookReviews (BookID, CustomerID, Rating, ReviewText, ReviewDate) VALUES
(1, 1, 5, 'Excellent!', '2024-04-01'),
(2, 2, 4, 'Good.', '2024-04-02'),
(3, 3, 3, 'Not bad.', '2024-04-03'),
(4, 4, 2, 'Below average.', '2024-04-04'),
(5, 5, 1, 'Bad.', '2024-04-05');

 * sqlite:///bookstore.db
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.

[]

**Check if the Data is inserted correctly**

In [32]:
%%sql
SELECT * FROM Books;

 * sqlite:///bookstore.db
Done.
Done.
Done.
Done.
Done.
Done.

[(11, 1, 1, 5, 'Excellent!', '2024-04-01'),
 (12, 2, 2, 4, 'Good.', '2024-04-02'),
 (13, 3, 3, 3, 'Not bad.', '2024-04-03'),
 (14, 4, 4, 2, 'Below average.', '2024-04-04'),
 (15, 5, 5, 1, 'Bad.', '2024-04-05')]

In [33]:
%%sql
SELECT * FROM Customers;

 * sqlite:///bookstore.db
Done.

[(1, 'Customer A', 'emailA@example.com', 'Address A'),
 (2, 'Customer B', 'emailB@example.com', 'Address B'),
 (3, 'Customer C', 'emailC@example.com', 'Address C'),
 (4, 'Customer D', 'emailD@example.com', 'Address D'),
 (5, 'Customer E', 'emailE@example.com', 'Address E')]

In [34]:
%%sql
SELECT * FROM Orders;

 * sqlite:///bookstore.db
Done.

[(1, 1, 1, 1, '2024-01-01'),
 (2, 2, 2, 2, '2024-01-02'),
 (3, 3, 3, 3, '2024-01-03'),
 (4, 4, 4, 4, '2024-01-04'),
 (5, 5, 5, 5, '2024-01-05')]

In [35]:
%%sql
SELECT * FROM Suppliers;

 * sqlite:///bookstore.db
Done.

[(1, 'Supplier A', 'Contact A'),
 (2, 'Supplier B', 'Contact B'),
 (3, 'Supplier C', 'Contact C'),
 (4, 'Supplier D', 'Contact D'),
 (5, 'Supplier E', 'Contact E')]

In [36]:
%%sql
SELECT * FROM SupplyOrders;

 * sqlite:///bookstore.db
Done.

[(1, 1, 1, 10, '2024-01-10'),
 (2, 2, 2, 20, '2024-01-20'),
 (3, 3, 3, 30, '2024-01-30'),
 (4, 4, 4, 40, '2024-02-10'),
 (5, 5, 5, 50, '2024-02-20')]

In [37]:
%%sql
SELECT * FROM BookReviews;

 * sqlite:///bookstore.db
Done.

[(11, 1, 1, 5, 'Excellent!', '2024-04-01'),
 (12, 2, 2, 4, 'Good.', '2024-04-02'),
 (13, 3, 3, 3, 'Not bad.', '2024-04-03'),
 (14, 4, 4, 2, 'Below average.', '2024-04-04'),
 (15, 5, 5, 1, 'Bad.', '2024-04-05')]

**Practice Data Retrieve, Join, and Data Relationships**

In [39]:
%%sql
-- Select all books that are less than price 4
SELECT * FROM Books WHERE Price < 4.00;

 * sqlite:///bookstore.db
Done.

[(1, 'Book Title A', 'Author A', 'Genre A', 1.0, 1),
 (2, 'Book Title B', 'Author B', 'Genre B', 2.0, 2),
 (3, 'Book Title C', 'Author C', 'Genre C', 3.0, 3)]

In [40]:
%%sql
-- List all customers that has Address A
SELECT * FROM Customers WHERE Address LIKE 'Address A';

 * sqlite:///bookstore.db
Done.

[(1, 'Customer A', 'emailA@example.com', 'Address A')]

In [41]:
%%sql
-- List all orders with book titles and customer names joined
SELECT Orders.OrderID, Books.Title, Customers.Name, Orders.Quantity, Orders.OrderDate
FROM Orders
JOIN Books ON Orders.BookID = Books.BookID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

 * sqlite:///bookstore.db
Done.

[(1, 'Book Title A', 'Customer A', 1, '2024-01-01'),
 (2, 'Book Title B', 'Customer B', 2, '2024-01-02'),
 (3, 'Book Title C', 'Customer C', 3, '2024-01-03'),
 (4, 'Book Title D', 'Customer D', 4, '2024-01-04'),
 (5, 'Book Title E', 'Customer E', 5, '2024-01-05')]

In [42]:
%%sql
-- List books with their reviews and customer emails for those who made a review joined
SELECT Books.Title, BookReviews.ReviewText, Customers.Email
FROM BookReviews
JOIN Books ON BookReviews.BookID = Books.BookID
JOIN Customers ON BookReviews.CustomerID = Customers.CustomerID;

 * sqlite:///bookstore.db
Done.

[('Book Title A', 'Excellent!', 'emailA@example.com'),
 ('Book Title B', 'Good.', 'emailB@example.com'),
 ('Book Title C', 'Not bad.', 'emailC@example.com'),
 ('Book Title D', 'Below average.', 'emailD@example.com'),
 ('Book Title E', 'Bad.', 'emailE@example.com')]

In [44]:
%%sql
-- Insert few more orders for next aggregation practice
INSERT INTO Orders (CustomerID, BookID, Quantity, OrderDate) VALUES
(1, 1, 6, '2024-01-01'),
(2, 2, 7, '2024-01-02'),
(3, 3, 8, '2024-01-03'),
(4, 4, 9, '2024-01-04'),
(5, 5, 10, '2024-01-05');

 * sqlite:///bookstore.db
5 rows affected.

[]

In [46]:
%%sql
-- Calculate total sales for each book -
SELECT Books.Title, SUM(Orders.Quantity) AS Total_Sold
FROM Orders
JOIN Books ON Orders.BookID = Books.BookID
GROUP BY Books.BookID;

 * sqlite:///bookstore.db
Done.

[('Book Title A', 7),
 ('Book Title B', 9),
 ('Book Title C', 11),
 ('Book Title D', 13),
 ('Book Title E', 15)]

In [51]:
%%sql
-- Insert few more supply orders for next aggregation practice
INSERT INTO SupplyOrders (SupplierID, BookID, Quantity, OrderDate) VALUES
(1, 1, 60, '2024-01-10'),
(2, 2, 70, '2024-01-20'),
(3, 3, 80, '2024-01-30'),
(4, 4, 90, '2024-02-10'),
(5, 5, 100, '2024-02-20');

 * sqlite:///bookstore.db
5 rows affected.

[]

In [52]:
%%sql
-- Count the number of books supplied by each supplier
SELECT Suppliers.Name, SUM(SupplyOrders.Quantity) AS Number_of_Books_Supplied
FROM SupplyOrders
JOIN Suppliers ON SupplyOrders.SupplierID = Suppliers.SupplierID
GROUP BY Suppliers.SupplierID;

 * sqlite:///bookstore.db
Done.

[('Supplier A', 70),
 ('Supplier B', 90),
 ('Supplier C', 110),
 ('Supplier D', 130),
 ('Supplier E', 150)]

In [53]:
%%sql
-- Insert few more book reviews for next aggregation practice
INSERT INTO BookReviews (BookID, CustomerID, Rating, ReviewText, ReviewDate) VALUES
(1, 1, 2, 'Excellent!', '2024-04-01'),
(2, 2, 4, 'Good.', '2024-04-02'),
(3, 3, 1, 'Not bad.', '2024-04-03'),
(4, 4, 5, 'Below average.', '2024-04-04'),
(5, 5, 3, 'Bad.', '2024-04-05');

 * sqlite:///bookstore.db
5 rows affected.

[]

In [54]:
%%sql
-- Average rating for each book
SELECT Books.Title, AVG(BookReviews.Rating) AS Average_Rating
FROM BookReviews
JOIN Books ON BookReviews.BookID = Books.BookID
GROUP BY Books.BookID;

 * sqlite:///bookstore.db
Done.

[('Book Title A', 3.5),
 ('Book Title B', 4.0),
 ('Book Title C', 2.0),
 ('Book Title D', 3.5),
 ('Book Title E', 2.0)]

In [57]:
%%sql
-- Count number of books with high rating (>=4), medium rating (2-3), and low rating (1)
SELECT
  SUM(CASE WHEN Rating >= 4 THEN 1 ELSE 0 END) AS High_Rating_Count,
  SUM(CASE WHEN Rating BETWEEN 2 AND 3 THEN 1 ELSE 0 END) AS Medium_Rating_Count,
  SUM(CASE WHEN Rating = 1 THEN 1 ELSE 0 END) AS Low_Rating_Count
FROM BookReviews;

 * sqlite:///bookstore.db
Done.

[(4, 4, 2)]